{
  "alertRules": [
    {
      "alertName": "Application Gateway - Failed requests crosses threshold",
      "alertDescription": "Cloud.PaaS.DCS-Azure-Web - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 1,
      "query": "AzureMetrics| where _ResourceId has \"microsoft.network/applicationgateways\"| where MetricName == \"FailedRequests\"| summarize AggregatedValue=sum(Total) by _ResourceId,bin(TimeGenerated,30m)| project TimeGenerated,SubscriptionID=split(_ResourceId,\"/\",2)[0],ResourceGroup=split(_ResourceId, \"/\",4)[0],ApplicationGateway=split(_ResourceId,\"/\",8)[0],FailedRequests=AggregatedValue,AggregatedValue,ResourceID=_ResourceId,alerthash=hash_md5(strcat(\"appGWFailedReqs\",_ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "threshold": 1800,
      "dimensionsName": "ResourceID",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue"
    },
    {
      "alertName": "Application Gateway - Unhealthy host count crosses threshold",
      "alertDescription": "Cloud.PaaS.DCS-Azure-Web - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 1,
      "query": "AzureMetrics | where _ResourceId has \"microsoft.network/applicationgateways\" | where MetricName == \"UnhealthyHostCount\" | project TimeGenerated, _ResourceId, MetricName, Count, Total, Minimum, Maximum | join ( AzureMetrics | where _ResourceId has \"microsoft.network/applicationgateways\" | where MetricName == \"HealthyHostCount\" | project TimeGenerated, _ResourceId, MetricName, Count, Total, Minimum, Maximum ) on TimeGenerated, _ResourceId | extend pctUnhealthy=round(100 * Maximum / (Maximum + Minimum1), 0) | summarize AggregatedValue=avg(pctUnhealthy) by _ResourceId, bin(TimeGenerated, 30m) | project TimeGenerated, SubscriptionID=split(_ResourceId, \"/\", 2)[0], ResourceGroup=split(_ResourceId, \"/\", 4)[0], ApplicationGateway=split(_ResourceId, \"/\", 8)[0], UnhealthyBackends_percentage=AggregatedValue, AggregatedValue, ResourceID=_ResourceId, alerthash=hash_md5(strcat(\"appGWpctUnhealthy\", _ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThanOrEqual",
      "windowSize": "PT30M",
      "threshold": 50,
      "dimensionsName": "ResourceID",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue"
    },
    {
      "alertName": "Application Gateway v1 - average CPU utilization crosses 80 perc",
      "alertDescription": "Cloud.PaaS.DCS-Azure-Web - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 2,
      "query": "AzureMetrics | where _ResourceId has \"microsoft.network/applicationgateways\" | where MetricName == \"CpuUtilization\" | summarize AggregatedValue=round(avg(Average), 1) by _ResourceId, bin(TimeGenerated, 30m) | project TimeGenerated, SubscriptionID=split(_ResourceId, \"/\", 2)[0], ResourceGroup=split(_ResourceId, \"/\", 4)[0], ApplicationGateway=split(_ResourceId, \"/\", 8)[0], Cpu_utilization_percentage=AggregatedValue, AggregatedValue, ResourceId=_ResourceId, alerthash=hash_md5(strcat(\"AppGw-v1-CpuUtilization\", _ResourceId)) ",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "threshold": 80,
      "dimensionsName": "ResourceId",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue"
    },
    {
      "alertName": "Application Gateway v1 - Response status 5xx crosses threshold",
      "alertDescription": "Cloud.PaaS.DCS-Azure-Web - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 2,
      "query": "AzureDiagnostics | where _ResourceId has \"microsoft.network/applicationgateways\" and Category == \"ApplicationGatewayAccessLog\" | where httpStatus_d > 499 | summarize count(httpStatus_d) by _ResourceId, bin(TimeGenerated, 30m)| extend AggregatedValue=count_httpStatus_d | project TimeGenerated, SubscriptionID=tostring(split(_ResourceId, \"/\", 2)[0]), ResourceGroup=split(_ResourceId, \"/\", 4)[0], ApplicationGateway=split(_ResourceId, \"/\", 8)[0], HTTP_5xx_count=AggregatedValue, AggregatedValue, ResourceId=_ResourceId, alerthash=hash_md5(strcat(\"AppGw-v1-HttpResponse\", _ResourceId)) ",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "threshold": 1800,
      "dimensionsName": "SubscriptionID",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue"
    },
    {
      "alertName": "Application Gateway v2 - Capacity Unit utilization crosses threshold",
      "alertDescription": "Cloud.PaaS.DCS-Azure-Web - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 2,
      "query": "AzureMetrics | where _ResourceId has \"microsoft.network/applicationgateways\" | where MetricName == \"CapacityUnits\" | summarize AggregatedValue=max(Average) by _ResourceId, bin(TimeGenerated, 30m) | project TimeGenerated, SubscriptionID=split(_ResourceId, \"/\", 2)[0], ResourceGroup=split(_ResourceId, \"/\", 4)[0], ApplicationGateway=split(_ResourceId, \"/\", 8)[0], CapacityUnits=AggregatedValue, AggregatedValue, ResourceID=_ResourceId, alerthash=hash_md5(strcat(\"appGWCapacityUnits\", _ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "threshold": 100,
      "dimensionsName": "ResourceID",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue"
    },
    {
      "alertName": "Application Gateway v2 - Total time crosses threshold",
      "alertDescription": "Cloud.PaaS.DCS-Azure-Web - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 2,
      "query": "AzureMetrics|where _ResourceId has \"microsoft.network/applicationgateways\"|where MetricName == \"ApplicationGatewayTotalTime\"|summarize AggregatedValue=avg(Average) by _ResourceId, bin(TimeGenerated, 30m)|project TimeGenerated,SubscriptionID=split(_ResourceId,\"/\",2)[0],ResourceGroup=split(_ResourceId,\"/\",4)[0],ApplicationGateway=split(_ResourceId,\"/\",8)[0],AppGatewayResponseTime_ms=AggregatedValue,AggregatedValue,ResourceID=_ResourceId,alerthash=hash_md5(strcat(\"appGWTotalTime\", _ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "threshold": 10000,
      "dimensionsName": "ResourceID",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue"
    },
    {
      "alertName": "Azure Firewall - Health Percent Less Than or Equal to Threshold",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 2,
      "query": "AzureMetrics | where ResourceId has \"AZUREFIREWALLS\" | where MetricName == \"FirewallHealth\" | summarize AggregatedValue=avg(Average) by _ResourceId, bin(TimeGenerated,30m)| project TimeGenerated, SubscriptionID=split(_ResourceId,\"/\",2)[0], ResourceGroup=split(_ResourceId,\"/\",4)[0],AzureFirewall=split(_ResourceId,\"/\",8)[0], FirewallHealthPercent=AggregatedValue, AggregatedValue, ResourceID=_ResourceId,alerthash=hash_md5(strcat(\"firewallHealth\",_ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "LessThanOrEqual",
      "windowSize": "PT30M",
      "threshold": 50,
      "dimensionsName": "ResourceID",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue"
    },
    {
      "alertName": "Create NSG",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 2,
      "query": "AzureActivity | where OperationNameValue == \"MICROSOFT.NETWORK/NETWORKSECURITYGROUPS/WRITE\" and ActivityStatusValue == \"Accept\" and ActivitySubstatusValue == \"Created\" | where Claims_d.appid <> \"[parameter(callerAppId)]\" | project Caller=iif(isempty(Caller),\"(Automation Runbook)\",Caller), SubscriptionId,Resource_group=split(_ResourceId, \"/\",4)[0],NSG_name=split(_ResourceId, \"/\",8)[0],ResourceID=_ResourceId",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "Create or Update Azure Firewall Rule Collection Group",
      "alertDescription": "Alert will be raised if a rule collection group in the Azure firewall policy is changed i.e. if a new rule collection group is created, new rule is added to an existing collection group, rule is delete in the existing collection group",
      "alertSeverity": 3,
      "query": "AzureActivity | where OperationNameValue == \"MICROSOFT.NETWORK/FIREWALLPOLICIES/RULECOLLECTIONGROUPS/WRITE\" and ActivityStatusValue == \"Success\" | where Claims_d.appid <> \"[parameter(callerAppId)]\" | project Caller=iif(isempty(Caller),\"(Automation Runbook)\",Caller), SubscriptionId,Resource_group=split(_ResourceId, \"/\",4)[0],ResourceID=split(_ResourceId, \"/\",8)[0], Resource = split(Properties_d.resource, \"/\",1)[0]",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "Create or update NSG rule",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE ID RESOURCES",
      "alertSeverity": 2,
      "query": "AzureActivity | where OperationNameValue == \"MICROSOFT.NETWORK/NETWORKSECURITYGROUPS/SECURITYRULES/WRITE\" and ActivityStatusValue == \"Success\" | extend p=parse_json(Properties) | project Caller=iif(isempty(Caller),\"(Automation Runbook)\",Caller), SubscriptionId,Resource_group=split(_ResourceId, \"/\",4)[0],NSG_name=split(_ResourceId, \"/\",8)[0], NSG_rule= p.resource,ResourceID=split(_ResourceId, \"/securityrules/\", 0)[0]",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "Create vNet",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 2,
      "query": "AzureActivity | where OperationNameValue == \"MICROSOFT.NETWORK/VIRTUALNETWORKS/WRITE\" and ActivityStatusValue == \"Accept\"| where Claims_d.appid <> \"[parameter(callerAppId)]\" | project Caller=iif(isempty(Caller),\"(Automation Runbook)\",Caller), SubscriptionId,Resource_Group=split(_ResourceId,\"/\",4)[0],VNET_name=split(_ResourceId,\"/\",8)[0],ResourceID=_ResourceId",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "Delete Azure Firewall Rule Collection Group",
      "alertDescription": "Alert will be raised if a rule collection group in the Azure firewall policy is deleted.",
      "alertSeverity": 3,
      "query": "AzureActivity | where OperationNameValue == \"MICROSOFT.NETWORK/FIREWALLPOLICIES/RULECOLLECTIONGROUPS/DELETE\" and ActivityStatusValue == \"Success\" | project Caller=iif(isempty(Caller),\"(Automation Runbook)\",Caller), SubscriptionId,Resource_group=split(_ResourceId, \"/\",4)[0],ResourceID=split(_ResourceId, \"/\",8)[0], Resource = split(Properties_d.resource, \"/\",1)[0]",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "Delete NSG rule",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE ID RESOURCES",
      "alertSeverity": 2,
      "query": "AzureActivity | where OperationNameValue == \"MICROSOFT.NETWORK/NETWORKSECURITYGROUPS/SECURITYRULES/DELETE\" and ActivityStatusValue == \"Success\" | extend p=parse_json(Properties) | project Caller=iif(isempty(Caller),\"(Automation Runbook)\",Caller), SubscriptionId,Resource_group=split(_ResourceId, \"/\",4)[0],NSG_name=split(_ResourceId, \"/\",8)[0], NSG_rule= p.resource",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "Delete NSG",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 1,
      "query": "AzureActivity | where OperationNameValue == \"MICROSOFT.NETWORK/NETWORKSECURITYGROUPS/DELETE\" and ActivityStatusValue==\"Success\" | summarize by CorrelationId, Caller, SubscriptionId, _ResourceId | project Caller=iif(isempty(Caller),\"(Automation Runbook)\",Caller), SubscriptionId,Resource_group=split(_ResourceId, \"/\",4)[0],NSG_name=split(_ResourceId, \"/\",8)[0],alerthash=hash_md5(strcat(_ResourceId)),ResourceID=_ResourceId",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "Delete vNet",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 2,
      "query": "AzureActivity | where OperationNameValue == \"MICROSOFT.NETWORK/VIRTUALNETWORKS/DELETE\" and ActivityStatusValue == \"Success\"| project Caller=iif(isempty(Caller),\"(Automation Runbook)\",Caller), SubscriptionId,Resource_Group=split(_ResourceId,\"/\",4)[0],VNET_name=split(_ResourceId,\"/\",8)[0], ResourceID=_ResourceId",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "ExpressRoute ARP Availability",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 2,
      "query": "AzureMetrics | where MetricName == \"ArpAvailability\" | summarize AggregatedValue=max(Average) by bin(TimeGenerated, 30m), _ResourceId | project TimeGenerated, SubscriptionID=tostring(split(_ResourceId,\"/\",2)[0]),ResourceGroup=split(_ResourceId,\"/\",4)[0],ExpressRoute=split(_ResourceId,\"/\",8)[0],CapacityUnits=AggregatedValue,AggregatedValue, ResourceID=_ResourceId, alerthash=hash_md5(strcat(\"arpavailabilitycapacityunits\",_ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "LessThan",
      "windowSize": "PT30M",
      "threshold": 100,
      "dimensionsName": "SubscriptionID",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue"
    },
    {
      "alertName": "ExpressRoute BGP Availability",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 2,
      "query": "AzureMetrics| where MetricName == \"BgpAvailability\"| summarize AggregatedValue=max(Average) by bin(TimeGenerated, 5m), _ResourceId | project TimeGenerated, SubscriptionID=tostring(split(_ResourceId,\"/\",2)[0]),ResourceGroup=split(_ResourceId,\"/\",4)[0],ExpressRoute=split(_ResourceId,\"/\",8)[0],CapacityUnits=AggregatedValue,AggregatedValue, ResourceID=_ResourceId, alerthash=hash_md5(strcat(\"bgpavailabilitycapacityunits\",_ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "LessThan",
      "windowSize": "PT30M",
      "threshold": 100,
      "dimensionsName": "SubscriptionID",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue"
    },
    {
      "alertName": "Load Balancer Approaching SNAT exhaustion",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 2,
      "query": "AzureMetrics | where MetricName == \"AllocatedSnatPorts\" | project _ResourceId, AllocatedPorts=Average, TimeGenerated | join (AzureMetrics | where MetricName == \"UsedSnatPorts\" | project _ResourceId,UsedPorts=Average, TimeGenerated ) on _ResourceId | extend Difference=AllocatedPorts - UsedPorts | summarize AggregatedValue = max(Difference) by bin(TimeGenerated,30m),_ResourceId | project TimeGenerated,SubscriptionID=split(_ResourceId,\"/\",2)[0],ResourceGroup=split(_ResourceId,\"/\",4)[0],LoadBalancer=tostring(split(_ResourceId,\"/\",8)[0]), CapacityUnits=AggregatedValue, AggregatedValue,ResourceID=_ResourceId,alerthash=hash_md5(strcat(\"lbCapacityUnits\",_ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "LessThanOrEqual",
      "windowSize": "PT30M",
      "threshold": 0,
      "dimensionsName": "LoadBalancer,TimeGenerated",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue",
      "skipQueryValidation": true
    },
    {
      "alertName": "Public IP DDOS Attack",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 0,
      "query": "AzureMetrics | where TimeGenerated > ago(15m) | where MetricName == \"IfUnderDDoSAttack\" | where _ResourceId contains \"MICROSOFT.NETWORK/PUBLICIPADDRESSES\" | where Total > 0 | project SubscriptionId, Resource_Group=ResourceGroup, Public_IP_Name=Resource, ResourceID=_ResourceId",
      "evaluationFrequency": "PT15M",
      "operator": "GreaterThan",
      "windowSize": "PT15M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "Vnet DDOS Attack",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 0,
      "query": "AzureMetrics | where TimeGenerated > ago(15m) | where MetricName == \"IfUnderDDoSAttack\" | where _ResourceId has \"microsoft.network/virtualnetworks\" | where Total > 0 | project SubscriptionID=_SubscriptionId, ResourceGroup, VirtualNetwork=Resource, Description, RemoteIPCountry, RemoteIPLatitude, RemoteIPLongitude, ResourceID=_ResourceId",
      "evaluationFrequency": "PT15M",
      "operator": "GreaterThan",
      "windowSize": "PT15M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "VPN Gateway Failed P2S connections",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 2,
      "query": "AzureDiagnostics| where Category == \"P2SDiagnosticLog\" and Message has \"Connection failed\"| summarize AggregatedValue = count() by _ResourceId,bin(TimeGenerated, 30m)| project TimeGenerated, SubscriptionID=split(_ResourceId,\"/\",2)[0],ResourceGroup=split(_ResourceId,\"/\",4)[0],VPNGateway=split(_ResourceId,\"/\",8)[0],CapacityUnits=AggregatedValue,AggregatedValue, ResourceID=_ResourceId, alerthash=hash_md5(strcat(\"vpnp2scapacityunits\",_ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "VPN Gateway P2S Bandwidth Utilization",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 2,
      "query": "AzureMetrics| where MetricName == \"P2SBandwidth\"| summarize AggregatedValue=max(Average) by _ResourceId, bin(TimeGenerated, 30m)| project TimeGenerated, SubscriptionID=tostring(split(_ResourceId,\"/\",2)[0]),ResourceGroup=split(_ResourceId,\"/\",4)[0],VPNGateway=split(_ResourceId,\"/\",8)[0],CapacityUnits=AggregatedValue,AggregatedValue, ResourceID=_ResourceId, alerthash=hash_md5(strcat(\"vpnbandiwdthcapacityunits\",_ResourceId))",
      "evaluationFrequency": "PT1M",
      "operator": "GreaterThan",
      "windowSize": "PT1M",
      "threshold": 80,
      "dimensionsName": "SubscriptionID",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue"
    },
    {
      "alertName": "VPN Gateway S2S tunnel disconnect",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 2,
      "query": "AzureDiagnostics| where Category == \"TunnelDiagnosticLog\" and status_s == \"Disconnected\"| summarize AggregatedValue = count() by _ResourceId,bin(TimeGenerated, 30m)| project TimeGenerated, SubscriptionID=split(_ResourceId,\"/\",2)[0],ResourceGroup=split(_ResourceId,\"/\",4)[0],VPNGateway=split(_ResourceId,\"/\",8)[0],DisconnectCount=AggregatedValue,AggregatedValue, ResourceID=_ResourceId, alerthash=hash_md5(strcat(\"vpntunneldisconnects\",_ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "VPN Gateway Tunnel Throughput",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 2,
      "query": "AzureMetrics | where MetricName == \"AverageBandwidth\" | summarize AggregatedValue=max(Average) / 1073741824 by _ResourceId, bin(TimeGenerated, 30m) | project TimeGenerated, SubscriptionID=tostring(split(_ResourceId,\"/\",2)[0]),ResourceGroup=split(_ResourceId,\"/\",4)[0],VPNGateway=split(_ResourceId,\"/\",8)[0],CapacityUnits=AggregatedValue,AggregatedValue, ResourceID=_ResourceId, alerthash=hash_md5(strcat(\"vpnthroughputcapacityunits\",_ResourceId))",
      "evaluationFrequency": "PT5M",
      "operator": "GreaterThan",
      "windowSize": "PT5M",
      "threshold": 1,
      "dimensionsName": "SubscriptionID",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue"
    },
    {
      "alertName": "VPN Gateway Tunnel Packet Drop Count",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 2,
      "query": "AzureMetrics | where MetricName =~ \"TunnelIngressPacketDropCount\" or MetricName =~ \"TunnelEgressPacketDropCount\" | project TimeGenerated, SubscriptionID=tostring(split(_ResourceId,\"/\",2)[0]), ResourceGroup=split(_ResourceId,\"/\",4)[0], VPNGateway=tolower(Resource), MetricName, Total, ResourceID=_ResourceId, alerthash=hash_md5(strcat(\"vpntunnelpacketdrops\",_ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "threshold": 0,
      "dimensionsName": "SubscriptionID",
      "timeAggregation": "Total",
      "metricMeasureColumn": "Total"
    },
    {
      "alertName": "VPN Gateway S2S BGP disconnect event",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 2,
      "query": "AzureDiagnostics | where Category == \"RouteDiagnosticLog\" and OperationName == \"BgpDisconnectedEvent\" | summarize AggregatedValue = count() by _ResourceId,bin(TimeGenerated, 5m) | project TimeGenerated, SubscriptionID=split(_ResourceId,\"/\",2)[0], ResourceGroup=split(_ResourceId,\"/\",4)[0], VPNGateway=split(_ResourceId,\"/\",8)[0], BgpDisconnectCount=AggregatedValue, AggregatedValue, ResourceID=_ResourceId, alerthash=hash_md5(strcat(\"vpnbgpdisconnect\",_ResourceId))",
      "evaluationFrequency": "PT5M",
      "operator": "GreaterThan",
      "windowSize": "PT5M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "ExpressRoute Gateway CPU utilization",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Network - Part of standard set of log alerts - Category AZURE RESOURCES",
      "alertSeverity": 2,
      "query": "AzureMetrics | where MetricName == \"ExpressRouteGatewayCpuUtilization\" | project TimeGenerated, SubscriptionID=tostring(split(_ResourceId,\"/\",2)[0]), ResourceGroup=split(_ResourceId,\"/\",4)[0], ExpressRouteGateway=tolower(Resource), AverageCPU=Average, ResourceID=_ResourceId, alerthash=hash_md5(strcat(\"expressroutecpu\",_ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "threshold": 80,
      "dimensionsName": "SubscriptionID",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AverageCPU"
    }
  ]
}