{
  "alertRules": [
    {
      "alertName": "Account failed to logon and tries more than 10 unsuccessful attempts",
      "alertDescription": "Cloud.IaaS.DCS-Azure-OS - Part of standard set of log alerts - Category COMPUTER SECURITY",
      "alertSeverity": 2,
      "query": "Event | where EventID == 4625 | extend d=parse_xml(EventData) | extend userName=d.DataItem.EventData.Data[5][\"#text\"] | summarize AggregatedValue = count() by bin(TimeGenerated, 30m), tostring(userName), Computer, _ResourceId | project TimeGenerated, SubscriptionID=split(_ResourceId, \"/\", 2)[0], Resource_group=split(_ResourceId, \"/\", 4)[0], Computer=split(_ResourceId, \"/\", 8)[0], Account_name=userName, Number_of_attempts=AggregatedValue, AggregatedValue, ResourceID=_ResourceId, alerthash=hash_md5(strcat(\"vmfailedlogin\", _ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "threshold": 10,
      "dimensionsName": "ResourceID",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue",
      "skipQueryValidation": true
    },
    {
      "alertName": "Audit log is cleared",
      "alertDescription": "Cloud.IaaS.DCS-Azure-OS - Part of standard set of log alerts - Category COMPUTER LOG SECURITY",
      "alertSeverity": 2,
      "query": "Event | where EventID == 517 or EventID == 1102 | project SubscriptionID=split(_ResourceId, \"/\", 2)[0], Resource_group=split(_ResourceId, \"/\", 4)[0], Computer, ResourceID=_ResourceId",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0,
      "skipQueryValidation": true
    },
    {
      "alertName": "Available memory low",
      "alertDescription": "Cloud.IaaS.DCS-Azure-OS - Part of standard set of log alerts - Category COMPUTER PERFORMANCE",
      "alertSeverity": 2,
      "query": "Perf | where ObjectName == \"Memory\" and CounterName =~ \"Available mbytes\" | summarize AvailableMemoryMB = round(avg(CounterValue),0) by bin(TimeGenerated, 30m), Computer, _ResourceId | join kind=leftouter ( VMComputer | summarize arg_max(TimeGenerated,*) by _ResourceId ) on _ResourceId | extend Available_Memory_percent = round((AvailableMemoryMB / PhysicalMemoryMB)*100, 1) | project TimeGenerated, Computer, AvailableMemoryMB, PhysicalMemoryMB, Available_Memory_percent, AggregatedValue=Available_Memory_percent, SubscriptionID=split(_ResourceId, \"/\",2)[0], Resource_group=split(_ResourceId, \"/\",4)[0], ResourceID=_ResourceId, alerthash=hash_md5(strcat(\"memavailpct\",_ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "LessThan",
      "windowSize": "PT30M",
      "threshold": 5,
      "dimensionsName": "ResourceID",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue"
    },
    {
      "alertName": "C disk space less than 10 percent",
      "alertDescription": "Cloud.IaaS.DCS-Azure-OS - Part of standard set of log alerts - Category COMPUTER PERFORMANCE",
      "alertSeverity": 2,
      "query": "Perf | where (ObjectName == \"LogicalDisk\" or ObjectName == \"Logical Disk\") and CounterName == \"% Free Space\" and InstanceName == \"C:\" | summarize AggregatedValue = avg(CounterValue) by bin(TimeGenerated, 30m), Computer, InstanceName, _ResourceId | project TimeGenerated,SubscriptionID=split(_ResourceId, \"/\",2)[0], Resource_group=split(_ResourceId, \"/\",4)[0],Computer=split(_ResourceId, \"/\",8)[0], Disk_free_space_percent=round(AggregatedValue,1), AggregatedValue=round(AggregatedValue,1),ResourceID=_ResourceId,alerthash=hash_md5(strcat(\"dskspace1\",_ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "LessThan",
      "windowSize": "PT30M",
      "threshold": 10,
      "dimensionsName": "ResourceID",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue"
    },
    {
      "alertName": "Computers where DSC software distribution failed after 5 attempts",
      "alertDescription": "Cloud.IaaS.DCS-Azure-OS - Part of standard set of log alerts - Category COMPUTER SOFTWARE",
      "alertSeverity": 2,
      "query": "let NbFailures=5;AzureDiagnostics|where Category == 'DscNodeStatus'|where OperationName contains 'DscResourceStatusData'|where DscResourceStatus_s in ('Failed','NotCompliant')|summarize count() by NodeName_s,DscResourceId_s,_ResourceId|where count_>NbFailures|join kind=inner(Heartbeat | summarize arg_max(TimeGenerated,*) by Computer| project NodeName_s=Computer,ResourceId) on NodeName_s|project Automation_account_name=split(_ResourceId, \"/\",8)[0],Computer = NodeName_s,SubscriptionID=split(ResourceId, \"/\",2)[0],Resource_group=split(ResourceId, \"/\",4)[0],DSC_resource_ID = DscResourceId_s,ResourceID=ResourceId,alerthash=hash_md5(strcat(\"dscerror\",ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "P2D",
      "timeAggregation": "Count",
      "threshold": 0,
      "skipQueryValidation": true
    },
    {
      "alertName": "CPU Utilization over 90 percent",
      "alertDescription": "Cloud.IaaS.DCS-Azure-OS - Part of standard set of log alerts - Category COMPUTER PERFORMANCE",
      "alertSeverity": 1,
      "query": "Perf | where ObjectName == \"Processor\" and CounterName == \"% Processor Time\" | summarize AggregatedValue = avg(CounterValue) by bin(TimeGenerated, 30m), _ResourceId | project TimeGenerated,SubscriptionID=split(_ResourceId, \"/\",2)[0], Resource_group=split(_ResourceId, \"/\",4)[0],Computer=split(_ResourceId, \"/\",8)[0], Processor_percent=round(AggregatedValue,1), AggregatedValue=round(AggregatedValue,1), ResourceID=_ResourceId,alerthash=hash_md5(strcat(\"cpu\",_ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "threshold": 90,
      "dimensionsName": "ResourceID",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue"
    },
    {
      "alertName": "Delete [parameter(productCode)] Azure Disk Encryption KeyVault",
      "alertDescription": "Cloud.PaaS.DCS-Azure-Security - Part of standard set of log alerts - Category COMPUTER SECURITY",
      "alertSeverity": 1,
      "query":  "AzureActivity | where OperationNameValue == \"MICROSOFT.KEYVAULT/VAULTS/DELETE\" and ActivityStatusValue==\"Success\" | project Caller=iif(isempty(Caller),\"(Automation Runbook)\",Caller), SubscriptionId,Resource_group=split(_ResourceId, \"/\",4)[0],Keyvault_name=split(_ResourceId, \"/\",8)[0],ResourceID=_ResourceId,FilterOnServiceProviderTagValue='[parameter(tagValuePrefix)]DiskEncryption'",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "Computers which had an Update Assessment Failure",
      "alertDescription": "Cloud.IaaS.DCS-Azure-OS - Part of standard set of log alerts - Category COMPUTER UPDATES",
      "alertSeverity": 1,
      "query": "arg('').patchassessmentresources | where type in~ (\"microsoft.compute/virtualmachines/patchassessmentresults\") | where properties.status =~ \"Failed\" | where properties.lastModifiedDateTime > ago(1h) | parse id with vmResourceId \"/patchAssessmentResults\" * | project subscriptionId, resourceGroup, Computer=split(id, \"/\", 8)[0], ResourceID=vmResourceId, alerthash=hash_md5(strcat(\"patchassessmentresults\",vmResourceId))",
      "evaluationFrequency": "PT60M",
      "operator": "GreaterThan",
      "windowSize": "PT60M",
      "timeAggregation": "Count",
      "threshold": 0,
      "isArgAlert": true
    },
    {
      "alertName": "Computers which had Patch Installation Failures",
      "alertDescription": "Cloud.IaaS.DCS-Azure-OS - Part of standard set of log alerts - Category COMPUTER UPDATES",
      "alertSeverity": 1,
      "query": "arg('').patchinstallationresources | where type in~ (\"microsoft.compute/virtualmachines/patchinstallationresults\") | where properties.status =~ \"Failed\" | where properties.lastModifiedDateTime > ago(1h) | parse id with vmResourceId \"/patchInstallationResults\" * | project subscriptionId, resourceGroup, Computer=split(id, \"/\", 8)[0], ResourceID=vmResourceId, alerthash=hash_md5(strcat(\"patchinstallationresults\",vmResourceId))",
      "evaluationFrequency": "PT60M",
      "operator": "GreaterThan",
      "windowSize": "PT60M",
      "timeAggregation": "Count",
      "threshold": 0,
      "isArgAlert": true
    },
    {
      "alertName": "Computers which had Schedule Failures",
      "alertDescription": "Cloud.IaaS.DCS-Azure-OS - Part of standard set of log alerts - Category COMPUTER UPDATES",
      "alertSeverity": 1,
      "query": "arg('').maintenanceresources | where type =~ \"microsoft.maintenance/maintenanceconfigurations/applyupdates\" | where properties.startDateTime > ago(1h) | where properties.maintenanceConfiguration.properties.maintenanceScope == \"InGuestPatch\" | project name, properties, id | extend status = tostring(properties.status) | where status in~ (\"Failed\") | project maintenanceConfigId = tolower(properties.maintenanceConfigurationId), maintenanceRunId = tolower(id), ResourceID = tolower(properties.maintenanceConfigurationId), status, alerthash=hash_md5(strcat(\"applyupdates\",id))",
      "evaluationFrequency": "PT60M",
      "operator": "GreaterThan",
      "windowSize": "PT60M",
      "timeAggregation": "Count",
      "threshold": 0,
      "isArgAlert": true
    },
    {
      "alertName": "Delete [parameter(productCode)] Azure Disk Encryption Set",
      "alertDescription": "Cloud.PaaS.DCS-Azure-Security - Part of standard set of log alerts - Category COMPUTER SECURITY",
      "alertSeverity": 0,
      "query": "AzureActivity | where OperationNameValue == \"MICROSOFT.COMPUTE/DISKENCRYPTIONSETS/DELETE\" and ActivityStatusValue==\"Success\" | summarize by CorrelationId, Caller, SubscriptionId, _ResourceId | project Caller=iif(isempty(Caller),\"(Automation Runbook)\",Caller), SubscriptionId,Resource_group=split(_ResourceId, \"/\",4)[0],DiskEncryptionSet_name=split(_ResourceId, \"/\",8)[0],FilterOnServiceProviderTagValue='[parameter(tagValuePrefix)]DiskEncryption', ResourceID=_ResourceId, alerthash=hash_md5(strcat(_ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "Failed Azure VM Backup restore attempt",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Storage - Part of standard set of log alerts - Category AZURE BACKUP",
      "alertSeverity": 1,
      "query": "let counter=1;AddonAzureBackupJobs| where JobOperation==\"Restore\"|sort by TimeGenerated desc | extend statusEntry = pack(\"JobStatus\", JobStatus, \"JobFailureCode\", JobFailureCode) | summarize laststatus=make_list(statusEntry,counter) by BackupItemUniqueId, ResourceId | where (array_length(laststatus)==counter) and (laststatus !contains 'Completed')| project SubscriptionID=split(tolower(ResourceId), \"/\",2)[0],Resource_group=split(BackupItemUniqueId, \";\")[3],Computer=split(BackupItemUniqueId, \";\")[4],Recovery_vault=split(tolower(ResourceId), \"/\",8)[0],Last_error=laststatus[0].JobFailureCode,ResourceID=strcat('/subscriptions/', tolower(split(tolower(ResourceId), \"/\", 2)[0]), '/resourceGroups/', tolower(split(BackupItemUniqueId, \";\")[3]), '/providers/Microsoft.Compute/virtualMachines/', tolower(split(BackupItemUniqueId, \";\")[4]))",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "Failed or incomplete Azure VM Backup with restore point more than 2 days old",
      "alertDescription": "Cloud.IaaS.DCS-Azure-Storage - Part of standard set of log alerts - Category AZURE BACKUP",
      "alertSeverity": 1,
      "query": "let NbDaysOld=2;AddonAzureBackupJobs| where JobOperation == \"Backup\"| sort by TimeGenerated desc| extend statusEntry = pack(\"JobStatus\", JobStatus, \"JobFailureCode\", JobFailureCode)| summarize laststatus=make_list(statusEntry, 1) by BackupItemUniqueId, ResourceId| where (laststatus !contains 'Completed')| join kind=leftouter(CoreAzureBackup|where OperationName==\"RecoveryPoint\" and BackupManagementType == \"IaaSVM\"|summarize arg_max(TimeGenerated,*) by BackupItemUniqueId) on BackupItemUniqueId| where isempty(LatestRecoveryPointTime) or (LatestRecoveryPointTime<ago(totimespan(strcat(NbDaysOld,\".00:00:00\"))))| project SubscriptionID=split(tolower(ResourceId), \"/\", 2)[0],Resource_group=split(BackupItemUniqueId, \";\")[3],Computer=split(BackupItemUniqueId, \";\")[4],Recovery_vault=split(tolower(ResourceId), \"/\", 8)[0],Last_job_status=laststatus[0].JobStatus,Last_error=laststatus[0].JobFailureCode,Latest_recovery_point_date=column_ifexists('LatestRecoveryPointTime', 'N/A'),ResourceID=strcat('/subscriptions/',tolower(split(tolower(ResourceId), \"/\", 2)[0]),'/resourceGroups/',tolower(split(BackupItemUniqueId, \";\")[3]),'/providers/Microsoft.Compute/virtualMachines/',tolower(split(BackupItemUniqueId, \";\")[4]))",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "Memory utilization greater than 80 percent",
      "alertDescription": "Cloud.IaaS.DCS-Azure-OS - Part of standard set of log alerts - Category COMPUTER PERFORMANCE",
      "alertSeverity": 2,
      "query": "Perf | where ObjectName == \"Memory\" and CounterName == \"% Committed Bytes In Use\" | summarize AggregatedValue = avg(CounterValue) by bin(TimeGenerated, 30m), Computer, _ResourceId | project TimeGenerated,SubscriptionID=split(_ResourceId, \"/\",2)[0], Resource_group=split(_ResourceId, \"/\",4)[0],Computer=split(_ResourceId, \"/\",8)[0], Memory_utilization_percent=round(AggregatedValue,1), AggregatedValue=round(AggregatedValue,1),ResourceID=_ResourceId,alerthash=hash_md5(strcat(\"memutiliz\",_ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "threshold": 80,
      "dimensionsName": "ResourceID",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue"
    },
    {
      "alertName": "Monitor failed virtual machines restart",
      "alertDescription": "Cloud.IaaS.DCS-Azure-OS - Part of standard set of log alerts - Category AZURE ACTIVITY",
      "alertSeverity": 1,
      "query": "AzureActivity | where OperationNameValue==\"MICROSOFT.COMPUTE/VIRTUALMACHINES/RESTART/ACTION\" and ActivityStatusValue==\"Success\" | project SubscriptionID=SubscriptionId,Resource_group=split(_ResourceId, \"/\",4)[0],Caller=Caller,Computer=split(_ResourceId, \"/\",8)[0], ResourceID=_ResourceId ",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "New [parameter(productCode)] Azure custom alert",
      "alertDescription": "Cloud.PaaS.DCS-Azure-Compute - Part of standard set of log alerts - Category CUSTOM ALERT",
      "alertSeverity": 2,
      "query": "ELZCustomAlerts_CL | where TimeGenerated > ago(1h) | project Additional_Alert_name=AlertName_s,Additional_Description=AlertDesc_s,Category=AlertCategory_s,Severity=AlertSeverity_s,ResourceID=AlertResourceId_s,SubscriptionID=split(split(AlertResourceId_s,'/subscriptions/')[1], '/')[0]",
      "evaluationFrequency": "PT15M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0,
      "skipQueryValidation": true
    },
    {
      "alertName": "non C disk space less than 10 percent",
      "alertDescription": "Cloud.IaaS.DCS-Azure-OS - Part of standard set of log alerts - Category COMPUTER PERFORMANCE",
      "alertSeverity": 2,
      "query": "Perf | where (ObjectName == \"LogicalDisk\" or ObjectName == \"Logical Disk\") and CounterName == \"% Free Space\" and InstanceName != \"C:\" and InstanceName != \"_Total\" | summarize AggregatedValue = avg(CounterValue) by bin(TimeGenerated, 30m), Computer, InstanceName, _ResourceId | project TimeGenerated,SubscriptionID=split(_ResourceId, \"/\",2)[0], Resource_group=split(_ResourceId, \"/\",4)[0],Computer=split(_ResourceId, \"/\",8)[0], AggregatedValue=round(AggregatedValue,1),Disk_free_space_percent=round(AggregatedValue,1), ResourceID=_ResourceId,alerthash=hash_md5(strcat(\"dskspace2\",_ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "LessThan",
      "windowSize": "PT30M",
      "threshold": 10,
      "dimensionsName": "ResourceID",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue"
    },
    {
      "alertName": "Password change by non-owner",
      "alertDescription": "Cloud.IaaS.DCS-Azure-OS - Part of standard set of log alerts - Category COMPUTER AD SECURITY",
      "alertSeverity": 2,
      "query": "Event | where EventID in (4723,4724,627,628) | mv-apply data = parse_xml(EventData).DataItem.EventData.Data on ( where data['@Name'] == 'TargetUserName' | extend TargetUserName = data['#text'] ) | mv-apply data = parse_xml(EventData).DataItem.EventData.Data on ( where data['@Name'] == 'SubjectUserName' | extend SubjectUserName = data['#text'] ) | where SubjectUserName != 'ANONYMOUS LOGON' and TargetUserName !endswith '$' and TargetUserName !in ( Event | where EventID in (4723,4724,627,628) | mv-apply data = parse_xml(EventData).DataItem.EventData.Data on ( where data['@Name'] == 'SubjectUserName' | extend SubjectUserName = data['#text'] ) | summarize AggregatedValue = count() by tostring(SubjectUserName)) | project SubscriptionID=split(_ResourceId, '/',2)[0], Resource_group=split(_ResourceId, '/',4)[0], Computer, Changed_by=SubjectUserName, Account_name=TargetUserName, ResourceID=_ResourceId",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0,
      "skipQueryValidation": true
    },
    {
      "alertName": "Processor Time greater than 50 percent",
      "alertDescription": "Cloud.IaaS.DCS-Azure-OS - Part of standard set of log alerts - Category COMPUTER PERFORMANCE",
      "alertSeverity": 2,
      "query": "Perf | where ObjectName == \"Processor\" and CounterName == \"% Processor Time\" | summarize AggregatedValue = avg(CounterValue) by bin(TimeGenerated, 30m), Computer, _ResourceId | project TimeGenerated,SubscriptionID=split(_ResourceId, \"/\",2)[0], Resource_group=split(_ResourceId, \"/\",4)[0],Computer=split(_ResourceId, \"/\",8)[0], Processor_time_percent=round(AggregatedValue,1), AggregatedValue=round(AggregatedValue,1),ResourceID=_ResourceId,alerthash=hash_md5(strcat(\"cputime\",_ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "threshold": 50,
      "dimensionsName": "ResourceID",
      "timeAggregation": "Average",
      "metricMeasureColumn": "AggregatedValue"
    },
    {
      "alertName": "Unresponsive agents based on OMS agent",
      "alertDescription": "Cloud.IaaS.DCS-Azure-OS - Part of standard set of log alerts - Category AGENT AVAILABILITY",
      "alertSeverity": 1,
      "query": "Heartbeat | summarize Lastcall = max(TimeGenerated) by Computer,SubscriptionId,_ResourceId | where Lastcall < ago(1h) | project SubscriptionId, Resource_group=split(_ResourceId, \"/\", 4)[0], Computer, Last_heartbeat=Lastcall, ResourceID=_ResourceId,alerthash=hash_md5(strcat(\"omsagent\",_ResourceId))",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0
    },
    {
      "alertName": "Unresponsive agents based on SCOM agent",
      "alertDescription": "Cloud.IaaS.DCS-Azure-OS - Part of standard set of log alerts - Category AGENT AVAILABILITY",
      "alertSeverity": 2,
      "query": "Event | where EventLog == \"Operations Manager\" and EventID == 6022 | summarize Lastcall = max(TimeGenerated) by Computer,_ResourceId | where Lastcall < ago(1h) | project SubscriptionID=split(_ResourceId, \"/\",2)[0], Resource_group=split(_ResourceId, \"/\",4)[0],Computer, Last_heartbeat=Lastcall, ResourceID=_ResourceId",
      "evaluationFrequency": "PT30M",
      "operator": "GreaterThan",
      "windowSize": "PT30M",
      "timeAggregation": "Count",
      "threshold": 0
    }
  ]
}